# Shell Environments and Customization
brew "fish"          # User-friendly command line shell
brew "fisher"        # Plugin manager for Fish shell
brew "starship"      # Cross-shell prompt
brew "nushell"       # Modern shell written in Rust

# Text Editors and IDE Tools
brew "neovim"        # Modern vim text editor
brew "helix"         # Modern text editor
brew "ripgrep"       # Fast search tool for code

# File Management and Navigation
brew "yazi"          # Terminal file manager
brew "broot"         # Terminal file manager
brew "eza"           # Modern replacement for ls
brew "bat"           # Cat clone with syntax highlighting

# Data Processing and Formatting
brew "jq"            # JSON processor
brew "yq"            # YAML processor
brew "fx"            # JSON viewer and processor
brew "choose"        # Alternative to cut/awk
brew "hck"           # Drop-in replacement for cut

# HTTP and Network Tools
brew "curl"          # Command line tool for transferring data
brew "xh"            # Friendly HTTP client

# System Monitoring and Observation
brew "viddy"         # Modern watch command
brew "tailspin"      # Log file highlighter and viewer
brew "btop"          # System resource monitor

# Development Tools
brew "mise"          # Development environment manager
brew "gettext"       # Internationalization and localization

tap "FelixKratz/formulae"
brew "borders"  # Window management tool

# Archive Management
brew "ouch"          # Painless compression/decompression

# Documentation and Help
brew "tldr"          # Simplified man pages

# Git and Version Control
brew "git"           # Version control system
brew "delta"         # Syntax-highlighting pager for git
brew "difftastic"    # Structural diff tool
brew "git-get"       # Git repository manager
brew "git-lfs"       # Git extension for large files
brew "glab"          # GitLab CLI tool
brew "gh"            # GitHub CLI tool
brew "lazygit"       # Simple terminal UI for git

# Programming Languages and SDKs
brew "go"            # Go programming language
brew "rustup"        # Rust toolchain installer
brew "python@3.12"   # Python programming language

# Container and Kubernetes Tools
brew "docker"                     # Docker CLI client
brew "docker-credential-helper"   # Docker credential helpers
brew "kind"                       # Kubernetes in Docker
brew "kubectl"                    # Kubernetes command-line tool
#brew "minikube"                   # Local Kubernetes cluster
brew "helm"                       # Kubernetes package manager
brew "helm-ls"                    # Helm language server
brew "kustomize"                  # Kubernetes configuration tool
brew "krew"                       # kubectl plugin manager
brew "kube-linter"                # Kubernetes YAML linter
brew "k9s"                        # Kubernetes CLI tool

