jorgebucaran/fisher
ilancosman/tide
jethrokuan/fzf
jhillyerd/plugin-git
oh-my-fish/plugin-pj
jethrokuan/z
evanlucas/fish-kubectl-completions
aluxian/fish-kube-prompt
